# GetElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..GetElementIds Method
SelectionFilterElement Class See Also
---
Returns the set of ElementIds contained by this filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetElementIds()
```

Visual Basic
---
```text
Public Function GetElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetElementIds()
```

# ### Return Value
The set of ElementIds.
# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace